docs/wsdl/CVLRestInquiry.wsdl

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions name="CVLRestInquiry" targetNamespace="https://krapancheck.cvlindia.com"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata"
    xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex"
    xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy"
    xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract"
    xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
    xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
    xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:tns="https://krapancheck.cvlindia.com" xmlns:wsa10="http://www.w3.org/2005/08/addressing"
    xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing">
    <wsp:Policy wsu:Id="BasicHttpBinding_ICVLRestInquiry_policy">
        <wsp:ExactlyOne>
            <wsp:All>
                <sp:TransportBinding xmlns:sp="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy">
                    <wsp:Policy>
                        <sp:TransportToken>
                            <wsp:Policy>
                                <sp:HttpsToken RequireClientCertificate="false" />
                            </wsp:Policy>
                        </sp:TransportToken>
                        <sp:AlgorithmSuite>
                            <wsp:Policy>
                                <sp:Basic256 />
                            </wsp:Policy>
                        </sp:AlgorithmSuite>
                        <sp:Layout>
                            <wsp:Policy>
                                <sp:Strict />
                            </wsp:Policy>
                        </sp:Layout>
                    </wsp:Policy>
                </sp:TransportBinding>
            </wsp:All>
        </wsp:ExactlyOne>
    </wsp:Policy>
    <wsdl:types>
        <xs:schema elementFormDefault="qualified" targetNamespace="https://krapancheck.cvlindia.com"
            xmlns:xs="http://www.w3.org/2001/XMLSchema">
            <xs:element name="GetPassword">
                <xs:complexType>
                    <xs:sequence>
                        <xs:element minOccurs="0" maxOccurs="1" name="password" type="xs:string" />
                        <xs:element minOccurs="0" maxOccurs="1" name="passKey" type="xs:string" />
                    </xs:sequence>
                </xs:complexType>
            </xs:element>
            <xs:element name="GetPasswordResponse">
                <xs:complexType>
                    <xs:sequence>
                        <xs:element minOccurs="0" maxOccurs="1" name="GetPasswordResult">
                            <xs:complexType mixed="true">
                                <xs:sequence>
                                    <xs:any />
                                </xs:sequence>
                            </xs:complexType>
                        </xs:element>
                    </xs:sequence>
                </xs:complexType>
            </xs:element>
            <xs:element name="GetPanStatus">
                <xs:complexType>
                    <xs:sequence>
                        <xs:element minOccurs="0" maxOccurs="1" name="panNo" type="xs:string" />
                        <xs:element minOccurs="0" maxOccurs="1" name="userName" type="xs:string" />
                        <xs:element minOccurs="0" maxOccurs="1" name="posCode" type="xs:string" />
                        <xs:element minOccurs="0" maxOccurs="1" name="password" type="xs:string" />
                        <xs:element minOccurs="0" maxOccurs="1" name="passKey" type="xs:string" />
                    </xs:sequence>
                </xs:complexType>
            </xs:element>
            <xs:element name="GetPanStatusResponse">
                <xs:complexType>
                    <xs:sequence>
                        <xs:element minOccurs="0" maxOccurs="1" name="GetPanStatusResult">
                            <xs:complexType mixed="true">
                                <xs:sequence>
                                    <xs:any />
                                </xs:sequence>
                            </xs:complexType>
                        </xs:element>
                    </xs:sequence>
                </xs:complexType>
            </xs:element>
        </xs:schema>
    </wsdl:types>
    <wsdl:message name="ICVLRestInquiry_GetPassword_InputMessage">
        <wsdl:part name="parameters" element="tns:GetPassword" />
    </wsdl:message>
    <wsdl:message name="ICVLRestInquiry_GetPassword_OutputMessage">
        <wsdl:part name="parameters" element="tns:GetPasswordResponse" />
    </wsdl:message>
    <wsdl:message name="ICVLRestInquiry_GetPanStatus_InputMessage">
        <wsdl:part name="parameters" element="tns:GetPanStatus" />
    </wsdl:message>
    <wsdl:message name="ICVLRestInquiry_GetPanStatus_OutputMessage">
        <wsdl:part name="parameters" element="tns:GetPanStatusResponse" />
    </wsdl:message>
    <wsdl:portType name="ICVLRestInquiry">
        <wsdl:operation name="GetPassword">
            <wsdl:input wsaw:Action="https://krapancheck.cvlindia.com/ICVLRestInquiry/GetPassword"
                message="tns:ICVLRestInquiry_GetPassword_InputMessage" />
            <wsdl:output wsaw:Action="https://krapancheck.cvlindia.com/ICVLRestInquiry/GetPasswordResponse"
                message="tns:ICVLRestInquiry_GetPassword_OutputMessage" />
        </wsdl:operation>
        <wsdl:operation name="GetPanStatus">
            <wsdl:input wsaw:Action="https://krapancheck.cvlindia.com/ICVLRestInquiry/GetPanStatus"
                message="tns:ICVLRestInquiry_GetPanStatus_InputMessage" />
            <wsdl:output wsaw:Action="https://krapancheck.cvlindia.com/ICVLRestInquiry/GetPanStatusResponse"
                message="tns:ICVLRestInquiry_GetPanStatus_OutputMessage" />
        </wsdl:operation>
    </wsdl:portType>
    <wsdl:binding name="BasicHttpBinding_ICVLRestInquiry" type="tns:ICVLRestInquiry">
        <wsp:PolicyReference URI="#BasicHttpBinding_ICVLRestInquiry_policy" />
        <soap:binding transport="http://schemas.xmlsoap.org/soap/http" />
        <wsdl:operation name="GetPassword">
            <soap:operation soapAction="https://krapancheck.cvlindia.com/ICVLRestInquiry/GetPassword"
                style="document" />
            <wsdl:input>
                <soap:body use="literal" />
            </wsdl:input>
            <wsdl:output>
                <soap:body use="literal" />
            </wsdl:output>
        </wsdl:operation>
        <wsdl:operation name="GetPanStatus">
            <soap:operation soapAction="https://krapancheck.cvlindia.com/ICVLRestInquiry/GetPanStatus"
                style="document" />
            <wsdl:input>
                <soap:body use="literal" />
            </wsdl:input>
            <wsdl:output>
                <soap:body use="literal" />
            </wsdl:output>
        </wsdl:operation>
    </wsdl:binding>
    <wsdl:service name="CVLRestInquiry">
        <wsdl:port name="BasicHttpBinding_ICVLRestInquiry" binding="tns:BasicHttpBinding_ICVLRestInquiry">
            <soap:address location="https://krapancheck.cvlindia.com/CVLRestInquiry.svc" />
        </wsdl:port>
    </wsdl:service>
</wsdl:definitions>